In [0]:
dbutils.widgets.text("table_name", "data_engineering_practice.app_data.employees_raw", "Table Name")

In [0]:
%sql
CREATE TABLE IF NOT EXISTS ${table_name} (
    emp_id INT,
    first_name STRING,
    last_name STRING,
    department STRING,
    salary INT,
    email STRING
);

In [0]:
%sql
-- Insert Batch 1
INSERT INTO data_engineering_practice.app_data.employees_raw VALUES
(1, 'John', 'Doe', 'IT', 75000, 'john.doe@example.com'),
(2, 'Jane', 'Smith', 'Finance', 62000, 'jane.smith@example.com'),
(3, 'Bob', 'Johnson', 'HR', 58000, 'bob.johnson@example.com'),
(4, 'Alice', 'Williams', 'Marketing', 67000, 'alice.williams@example.com'),
(5, 'Mark', 'Lee', 'IT', NULL, 'mark.lee@example.com'),
(6, 'Nina', 'Brown', 'Sales', 55000, 'nina.brown@example.com'),
(7, 'Eva', 'Taylor', 'Finance', 60000, 'eva.taylor@example.com'),
(8, 'Chris', 'Clark', 'IT', 72000, 'chris.clark@example.com'),
(9, 'Sophia', 'Adams', 'HR', 59000, 'sophia.adams@example.com'),
(10, 'Tom', 'Evans', 'IT', 64000, 'tom.evans@example.com'),
(11, 'Rachel', 'Green', 'Marketing', 68000, 'rachel.green@example.com'),
(12, 'Monica', 'Geller', 'HR', 58000, 'monica.geller@example.com'),
(13, 'Ross', 'Geller', 'Finance', 63000, 'ross.geller@example.com'),
(14, 'Chandler', 'Bing', 'IT', NULL, 'chandler.bing@example.com'),
(15, 'Joey', 'Tribbiani', 'Sales', 54000, 'joey.tribbiani@example.com'),
(16, 'Phoebe', 'Buffay', 'HR', 61000, 'phoebe.buffay@example.com'),
(17, 'Mike', 'Hannigan', 'Marketing', 66000, 'mike.hannigan@example.com'),
(18, 'Janice', 'Litman', 'Sales', 50000, 'janice.litman@example.com'),
(19, 'Emily', 'Waltham', 'Finance', 62000, 'emily.waltham@example.com'),
(20, 'John', 'Doe', 'IT', 75000, 'john.doe@example.com'); -- duplicate email

-- Insert Batch 2
INSERT INTO data_engineering_practice.app_data.employees_raw VALUES
(21, 'Daniel', 'Smith', 'IT', 68000, 'daniel.smith@example.com'),
(22, 'Laura', 'Hill', 'HR', 57000, 'laura.hill@example.com'),
(23, 'Henry', 'Ford', 'Marketing', 69000, 'henry.ford@example.com'),
(24, 'Diana', 'Prince', 'Finance', 61000, 'diana.prince@example.com'),
(25, 'Clark', 'Kent', 'IT', NULL, 'clark.kent@example.com'),
(26, 'Bruce', 'Wayne', 'Sales', 74000, 'bruce.wayne@example.com'),
(27, 'Peter', 'Parker', 'Marketing', 56000, 'peter.parker@example.com'),
(28, 'Tony', 'Stark', 'IT', 85000, 'tony.stark@example.com'),
(29, 'Steve', 'Rogers', 'Finance', 63000, 'steve.rogers@example.com'),
(30, 'Natasha', 'Romanoff', 'HR', 60000, 'natasha.romanoff@example.com'),
(31, 'Wanda', 'Maximoff', 'Sales', 62000, 'wanda.maximoff@example.com'),
(32, 'Sam', 'Wilson', 'Finance', 59000, 'sam.wilson@example.com'),
(33, 'Bucky', 'Barnes', 'IT', 70000, 'bucky.barnes@example.com'),
(34, 'Scott', 'Lang', 'Sales', 58000, 'scott.lang@example.com'),
(35, 'Hope', 'Van Dyne', 'Marketing', 66000, 'hope.dyne@example.com'),
(36, 'Stephen', 'Strange', 'IT', 77000, 'stephen.strange@example.com'),
(37, 'Nick', 'Fury', 'Finance', 72000, 'nick.fury@example.com'),
(38, 'Phil', 'Coulson', 'HR', 57000, 'phil.coulson@example.com'),
(39, 'Carol', 'Danvers', 'IT', 83000, 'carol.danvers@example.com'),
(40, 'Maria', 'Hill', 'Marketing', 64000, 'maria.hill@example.com');


-- Insert Batch 3
INSERT INTO data_engineering_practice.app_data.employees_raw VALUES
(41, 'Pepper', 'Potts', 'Sales', 67000, 'pepper.potts@example.com'),
(42, 'Happy', 'Hogan', 'HR', 61000, 'happy.hogan@example.com'),
(43, 'Jarvis', 'AI', 'IT', 88000, 'jarvis.ai@example.com'),
(44, 'Shuri', 'Wakanda', 'Finance', 69000, 'shuri.wakanda@example.com'),
(45, 'TChalla', 'Panther', 'Marketing', NULL, 'tchalla.panther@example.com'),
(46, 'Rocket', 'Raccoon', 'IT', 62000, 'rocket.raccoon@example.com'),
(47, 'Groot', 'Tree', 'Sales', 61000, 'groot.tree@example.com'),
(48, 'Drax', 'Destroyer', 'HR', 56000, 'drax.destroyer@example.com'),
(49, 'Gamora', 'Zen', 'Finance', 65000, 'gamora.zen@example.com'),
(50, 'Nebula', 'Cyber', 'Marketing', 64000, 'nebula.cyber@example.com');

/*
-- Data to insert on 1st batch
INSERT INTO ${table_name} VALUES
(51, 'Thanos', 'Titan', 'Sales', 71000, 'thanos.titan@example.com'),
(52, 'Loki', 'Odinson', 'HR', 67000, 'loki.odinson@example.com'),
(53, 'Odin', 'Allfather', 'Finance', 73000, 'odin.allfather@example.com'),
(54, 'Frigga', 'Queen', 'Marketing', 68000, 'frigga.queen@example.com'),
(55, 'Heimdall', 'Gatekeeper', 'IT', 72000, 'heimdall.gate@example.com'),
(56, 'Korg', 'Rock', 'Sales', 57000, 'korg.rock@example.com'),
(57, 'Miek', 'Bug', 'HR', 56000, 'miek.bug@example.com'),
(58, 'Jane', 'Foster', 'Finance', 69000, 'jane.foster@example.com'),
(59, 'Darcy', 'Lewis', 'Marketing', 63000, 'darcy.lewis@example.com'),
(60, 'Erik', 'Selvig', 'IT', 64000, 'erik.selvig@example.com');

-- Data to insert on 2nd batch

INSERT INTO ${table_name} VALUES
(61, 'Nick', 'Cage', 'Finance', 66000, 'nick.cage@example.com'),
(62, 'Bruce', 'Banner', 'IT', 78000, 'bruce.banner@example.com'),
(63, 'Betty', 'Ross', 'HR', NULL, 'betty.ross@example.com'),
(64, 'Matt', 'Murdock', 'Sales', 61000, 'matt.murdock@example.com'),
(65, 'Jessica', 'Jones', 'Marketing', 59000, 'jessica.jones@example.com'),
(66, 'Luke', 'Cage', 'Finance', 64000, 'luke.cage@example.com'),
(67, 'Danny', 'Rand', 'IT', 67000, 'danny.rand@example.com'),
(68, 'Colleen', 'Wing', 'Sales', 60000, 'colleen.wing@example.com'),
(69, 'Karen', 'Page', 'HR', 62000, 'karen.page@example.com'),
(70, 'Foggy', 'Nelson', 'Finance', 63000, 'foggy.nelson@example.com'),
(71, 'Elecktra', 'Natchios', 'Marketing', 66000, 'elecktra.natchios@example.com'),
(72, 'Stick', 'Sensei', 'Sales', 58000, 'stick.sensei@example.com'),
(73, 'Wilson', 'Fisk', 'Finance', 70000, 'wilson.fisk@example.com'),
(74, 'Frank', 'Castle', 'IT', 76000, 'frank.castle@example.com'),
(75, 'Karen', 'Page', 'HR', 62000, 'karen.page@example.com'), -- duplicate email
(76, 'Clint', 'Barton', 'Sales', 69000, 'clint.barton@example.com'),
(77, 'Kate', 'Bishop', 'Marketing', 61000, 'kate.bishop@example.com'),
(78, 'Yelena', 'Belova', 'Finance', NULL, 'yelena.belova@example.com'),
(79, 'Alexei', 'Shostakov', 'IT', 70000, 'alexei.shostakov@example.com'),
(80, 'Melina', 'Vostokoff', 'Marketing', 62000, 'melina.vostokoff@example.com');

--Data to insert on 3rd batch

INSERT INTO ${table_name} VALUES
(81, 'Red', 'Guardian', 'Sales', 61000, 'red.guardian@example.com'),
(82, 'Valentina', 'Allegra', 'Finance', 68000, 'valentina.allegra@example.com'),
(83, 'Shang', 'Chi', 'IT', 75000, 'shang.chi@example.com'),
(84, 'Wenwu', 'Xu', 'Marketing', 67000, 'wenwu.xu@example.com'),
(85, 'Katy', 'Chen', 'Sales', 58000, 'katy.chen@example.com'),
(86, 'Trevor', 'Slattery', 'HR', 55000, 'trevor.slattery@example.com'),
(87, 'Morris', 'Myth', 'Finance', 60000, 'morris.myth@example.com'),
(88, 'Namor', 'Submariner', 'Marketing', 69000, 'namor.sub@example.com'),
(89, 'Okoye', 'Wakanda', 'IT', 74000, 'okoye.wakanda@example.com'),
(90, 'Ayo', 'Wakanda', 'Sales', 60000, 'ayo.wakanda@example.com'),
(91, 'Riri', 'Williams', 'Finance', 61000, 'riri.williams@example.com'),
(92, 'Kamala', 'Khan', 'Marketing', 58000, 'kamala.khan@example.com'),
(93, 'Bruno', 'Carelli', 'Sales', 57000, 'bruno.carelli@example.com'),
(94, 'Zoe', 'Zimmer', 'Finance', 63000, 'zoe.zimmer@example.com'),
(95, 'Nakia', 'Wakanda', 'HR', 64000, 'nakia.wakanda@example.com'),
(96, 'Ramonda', 'Wakanda', 'HR', 66000, 'ramonda.wakanda@example.com'),
(97, 'Everett', 'Ross', 'Finance', 62000, 'everett.ross@example.com'),
(98, 'Ulysses', 'Klaue', 'Sales', 60000, 'ulysses.klaue@example.com'),
(99, 'Zemo', 'Baron', 'Finance', 65000, 'zemo.baron@example.com'),
(100, 'Agatha', 'Harkness', 'HR', 62000, 'agatha.harkness@example.com');*/

In [0]:
print("Hello")